#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tfe_workspace.iac_ws["iac-azure-resources"]: Refreshing state... [id=ws-zj7feQucod5mRUag]
module.ansible_roles["ansible-role-cryptominer"].github_repository.repo: Refreshing state... [id=ansible-role-cryptominer]
github_user_ssh_key.ssh_key_ansible: Refreshing state... [id=57866186]
module.iac_repos["iac-azure-resources"].github_repository.repo: Refreshing state... [id=iac-azure-resources]
module.ansible_roles["ansible-role-zsh"].github_repository.repo: Refreshing state... [id=ansible-role-zsh]
module.ansible_roles["ansible-role-k8s-certificates"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-certificates]
module.azdo_terraform_pipeline_templates.github_repository.repo: Refreshing state... [id=azdo-terraform-pipeline-templates]
module.ansible_roles["ansible-role-vagrant"].github_repository.repo: Refreshing state... [id=ansible-role-vagrant]
module.ansible_control.github_repository.repo: Refreshing state... [id=ansible-control]
module.ansible_roles["ansible-role-terraform"].github_repository.repo: Refreshing state... [id=ansible-role-terraform]
module.iac_github_mgmt.github_repository.repo: Refreshing state... [id=iac-github-mgmt]
module.ansible_roles["ansible-role-k8s-node"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-node]
github_user_ssh_key.ssh_key_cultclassik: Refreshing state... [id=54706683]
github_actions_secret.tf_api_token["iac-azure-resources"]: Refreshing state... [id=iac-azure-resources:TF_API_TOKEN]
module.diehlabs_ansible_roles["ansible-role-git"].github_repository.repo: Refreshing state... [id=ansible-role-git]
module.diehlabs_iac_repos["pulumi-kube-sandbox"].github_repository.repo: Refreshing state... [id=pulumi-kube-sandbox]
module.github_action_templates.github_repository.repo: Refreshing state... [id=.github]
module.terraform_module_repo_template.github_repository.repo: Refreshing state... [id=terraform-module-scaffolding]
module.diehlabs_ansible_roles["ansible-role-kubetools"].github_repository.repo: Refreshing state... [id=ansible-role-kubetools]
module.diehlabs_ansible_roles["ansible-role-scaffolding"].github_repository.repo: Refreshing state... [id=ansible-role-scaffolding]
module.diehlabs_ansible_roles["ansible-role-terraform"].github_repository.repo: Refreshing state... [id=ansible-role-terraform]
module.diehlabs_ansible_roles["ansible-role-docker"].github_repository.repo: Refreshing state... [id=ansible-role-docker]
module.diehlabs_terraform_module_repos["terraform-azurerm-linuxvm"].github_repository.repo: Refreshing state... [id=terraform-azurerm-linuxvm]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_repository.repo: Refreshing state... [id=terraform-azurerm-o365dns]
tfe_workspace.iac_github_mgmt: Refreshing state... [id=ws-MyypkggTqKQ9xbSY]
github_actions_secret.iac_github_mgmt_tftoken: Refreshing state... [id=iac-github-mgmt:TF_API_TOKEN]
module.ansible_control.github_branch_default.default: Refreshing state... [id=ansible-control]
module.iac_repos["iac-azure-resources"].github_branch_default.default: Refreshing state... [id=iac-azure-resources]
module.azdo_terraform_pipeline_templates.github_branch_default.default: Refreshing state... [id=azdo-terraform-pipeline-templates]
module.iac_github_mgmt.github_branch_default.default: Refreshing state... [id=iac-github-mgmt]
module.github_action_templates.github_branch_default.default: Refreshing state... [id=.github]
module.terraform_module_repo_template.github_branch_default.default: Refreshing state... [id=terraform-module-scaffolding]
module.diehlabs_iac_repos["pulumi-kube-sandbox"].github_branch_default.default: Refreshing state... [id=pulumi-kube-sandbox]
module.ansible_roles["ansible-role-zsh"].github_branch_default.default: Refreshing state... [id=ansible-role-zsh]
module.ansible_roles["ansible-role-cryptominer"].github_branch_default.default: Refreshing state... [id=ansible-role-cryptominer]
module.ansible_roles["ansible-role-k8s-certificates"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-certificates]
module.ansible_roles["ansible-role-terraform"].github_branch_default.default: Refreshing state... [id=ansible-role-terraform]
module.ansible_roles["ansible-role-k8s-node"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-node]
module.ansible_roles["ansible-role-vagrant"].github_branch_default.default: Refreshing state... [id=ansible-role-vagrant]
module.diehlabs_ansible_roles["ansible-role-terraform"].github_branch_default.default: Refreshing state... [id=ansible-role-terraform]
module.diehlabs_ansible_roles["ansible-role-docker"].github_branch_default.default: Refreshing state... [id=ansible-role-docker]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_branch_default.default: Refreshing state... [id=terraform-azurerm-o365dns]
module.diehlabs_ansible_roles["ansible-role-kubetools"].github_branch_default.default: Refreshing state... [id=ansible-role-kubetools]
module.diehlabs_ansible_roles["ansible-role-git"].github_branch_default.default: Refreshing state... [id=ansible-role-git]
module.diehlabs_ansible_roles["ansible-role-scaffolding"].github_branch_default.default: Refreshing state... [id=ansible-role-scaffolding]
module.diehlabs_terraform_module_repos["terraform-azurerm-linuxvm"].github_branch_default.default: Refreshing state... [id=terraform-azurerm-linuxvm]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.diehlabs_iac_repos["pulumi-kube-sandbox"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"219bff2f9a71a98ee282e56f2d4471a0a3fdd67eb1f1f8cd0d5278695ff18fae\"" -> "W/\"576cea43e5032b64e7ab7d4745eeaa5bb1e3b586fc83d73c1f4a15b0056a90e2\""
        id                     = "pulumi-kube-sandbox"
        name                   = "pulumi-kube-sandbox"
      + topics                 = []
        # (24 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.diehlabs_terraform_module_repos["terraform-tls-k8scerts"].data.github_branch.main will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "main"  {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "terraform-tls-k8scerts"
      + sha        = (known after apply)
    }

  # module.diehlabs_terraform_module_repos["terraform-tls-k8scerts"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "terraform-tls-k8scerts"
    }

  # module.diehlabs_terraform_module_repos["terraform-tls-k8scerts"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Terraform module for creating TLS certificates for a Kubernetes cluster - Repo managed by Terraform"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-tls-k8scerts"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"

      + template {
          + owner      = "Diehlabs"
          + repository = "terraform-module-scaffolding"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*